<?php
/**
 * Created by PhpStorm.
 * User: Iolanta
 * Date: 15.02.2016
 * Time: 20:19
 */

echo '<h3>' . 'Exercise 5' . '</h3>';

echo '<h3>' . 'Условие' . '</h3>';

echo '<p>Дан массив $arr с ключами \'Коля\', \'Вася\', \'Петя\' с элементами \'200\', \'300\', \'400\'. С помощью цикла foreach выведите на экран столбец строк такого формата: \'Коля — зарплата 200 долларов.\' </p>';

echo '<h3>' . 'Результат' . '</h3>';

$arr_name = array ('Коля'=>'200', 'Вася'=>'300', 'Петя'=>'400');

foreach ($arr_name as $name => $numb) {
    echo $name . ' — зарплата ' . $numb . ' долларов.' . '<br>';
}
