<?php
/**
 * Created by PhpStorm.
 * User: Iolanta
 * Date: 15.02.2016
 * Time: 20:19
 */

echo '<h3>' . 'Exercise 7' . '</h3>';

echo '<h3>' . 'Условие' . '</h3>';

echo '<p>Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла foreach и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.  </p>';

echo '<h3>' . 'Результат' . '</h3>';

$num = array(2, 5, 9, 15, 0, 4);

foreach ($num as $i) {
    if ($i > 3) {
        if ($i < 10) {
            echo $i . '<br>';
        }
    }
}
