<?php
/**
 * Created by PhpStorm.
 * User: Iolanta
 * Date: 15.02.2016
 * Time: 20:19
 */

echo '<h3>' . 'Exercise 13' . '</h3>';

echo '<h3>' . 'Условие' . '</h3>';

echo '<p>Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. С помощью цикла foreach и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.  </p>';

echo '<h3>' . 'Результат' . '</h3>';

$num2 = array(4, 2, 5, 19, 13, 0, 10);

foreach ($num2 as $i2) {
    if ($i2 > 3) {
        if ($i2 < 10) {
            echo $i2 . '<br>';
        }
    }
}